; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 157646 2 3 4 4 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	spectrograph1 - mode
	spectrograph2 - mode
	infrared0 - mode
	infrared3 - mode
	Star0 - direction
	GroundStation3 - direction
	Star1 - direction
	Star2 - direction
	Phenomenon4 - direction
	Phenomenon5 - direction
	Star6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Star9 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star0)
	(supports instrument1 infrared0)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon8)
	(supports instrument2 infrared0)
	(supports instrument2 spectrograph2)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 GroundStation3)
	(supports instrument3 infrared3)
	(calibration_target instrument3 Star1)
	(supports instrument4 infrared3)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 Star2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
)
(:goal (and
	(have_image Phenomenon4 infrared0)
	(have_image Phenomenon5 spectrograph2)
	(have_image Star6 spectrograph1)
	(have_image Star7 infrared3)
	(have_image Phenomenon8 infrared0)
	(have_image Star9 spectrograph2)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 6
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
3. (turn_to satellite1 star9 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star9)
   goals met: 0 of 6
4. (turn_to satellite0 star0 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 star0)
   goals met: 0 of 6
5. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 0 of 6
6. (turn_to satellite1 groundstation3 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 groundstation3)
   goals met: 0 of 6
7. (turn_to satellite0 star7 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star7)
   goals met: 0 of 6
8. (calibrate satellite1 instrument2 groundstation3)
   added: (calibrated instrument2)
   goals met: 0 of 6
9. (take_image satellite0 star7 instrument0 infrared3)
   added: (have_image star7 infrared3)
   goals met: 1 of 6
10. (turn_to satellite1 star9 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 star9)
   goals met: 1 of 6
11. (turn_to satellite0 phenomenon4 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 phenomenon4)
   goals met: 1 of 6
12. (take_image satellite1 star9 instrument2 spectrograph2)
   added: (have_image star9 spectrograph2)
   goals met: 2 of 6
13. (turn_to satellite1 star6 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star6)
   goals met: 2 of 6
14. (take_image satellite0 phenomenon4 instrument0 infrared0)
   added: (have_image phenomenon4 infrared0)
   goals met: 3 of 6
15. (turn_to satellite0 phenomenon8 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 phenomenon8)
   goals met: 3 of 6
16. (take_image satellite1 star6 instrument2 spectrograph1)
   added: (have_image star6 spectrograph1)
   goals met: 4 of 6
17. (turn_to satellite1 phenomenon5 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 phenomenon5)
   goals met: 4 of 6
18. (take_image satellite0 phenomenon8 instrument0 infrared0)
   added: (have_image phenomenon8 infrared0)
   goals met: 5 of 6
19. (take_image satellite1 phenomenon5 instrument2 spectrograph2)
   added: (have_image phenomenon5 spectrograph2)
   goals met: 6 of 6
